{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend entry point.",
  "feature_evidence.json": "Feature evidence report documenting a single high-confidence feature to remove gradient styling from the HeroSection name text and replace it with a solid warm color.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing the resume application's structure, components, styling, data model, and canonical domain redirect logic.",
  "frontend/index.css": "Tailwind base styles defining CSS custom properties for light and dark themes using OKLCH color space with warm, earthy tones.",
  "frontend/index.html": "HTML entry point with canonical link to fatimachowdhury.com and client-side script that redirects from Caffeine draft domains after checking canonical domain reachability with 5-minute cache.",
  "frontend/src/App.tsx": "Main React component rendering the complete resume layout with TopNav, all content sections (conditionally rendering ProjectsSection based on data), and Footer.",
  "frontend/src/components/layout/Footer.tsx": "Footer component displaying copyright notice with inline unicode heart symbol.",
  "frontend/src/components/layout/Section.tsx": "Reusable section wrapper component providing consistent spacing, max-width container, and optional title/subtitle rendering.",
  "frontend/src/components/layout/TopNav.tsx": "Responsive navigation bar with smooth scroll links, mobile hamburger menu, and dynamically generated nav items that exclude Projects link when projects array is empty.",
  "frontend/src/components/sections/AboutSection.tsx": "About section displaying professional summary (if present) and personal details (location, email, phone) in a card layout with icons, conditionally rendering phone field.",
  "frontend/src/components/sections/ContactSection.tsx": "Contact section component displaying email with copy-to-clipboard functionality, optional phone number, and social media links (LinkedIn, GitHub, Twitter) with icons.",
  "frontend/src/components/sections/EducationSection.tsx": "Education section component that displays academic background with degree, institution, location, period, and optional details in card format.",
  "frontend/src/components/sections/ExperienceSection.tsx": "Work experience section component showing job title, company, location, period, description, and bullet-pointed highlights for each position.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero landing section with animated background, displaying name, title (Computer Science), and call-to-action buttons to scroll to contact or about sections.",
  "frontend/src/components/sections/ProjectsSection.tsx": "Projects section component displaying featured projects in a grid layout with title, description, technologies used, and optional external links.",
  "frontend/src/components/sections/SkillsSection.tsx": "Skills section component with special handling for single-category layouts (two-column split) and multi-category layouts (grid of skill cards by category).",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages backend actor instances based on Internet Identity authentication state, invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for React Query hooks to interact with backend; currently empty with no backend methods implemented.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme color palettes using OKLCH color space, plus utility classes for sections and gradient text.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/resumeData.ts": "TypeScript interfaces and data for a resume/portfolio including work experience, education, skills, and contact information for Fatima Chowdhury, a Computer Science student.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom fonts, OKLCH-based color system, border radius variables, shadows, and animations including accordion and fade-in effects.",
  "project_state.json": "Project metadata tracking a feature request to remove gradient styling from a name text element in HeroSection and replace it with solid color, plus a known issue with message sending functionality."
}