{
  "backend/main.mo": "Minimal Motoko actor with no methods or logic.",
  "feature_evidence.json": "Feature evidence report describing a redirect-logic update tied to frontend/index.html with linked components, tests, and metadata.",
  "frontend-file-summaries.txt": "Text file containing prewritten short descriptions of various frontend files and their functionality.",
  "frontend/index.css": "Tailwind base/styles with custom OKLCH color variables for light/dark mode and global background/foreground application.",
  "frontend/index.html": "Main HTML entry point including fonts, canonical link, and reachability‑based redirect logic for Caffeine draft domains.",
  "frontend/src/App.tsx": "Root React component assembling all page sections and conditionally rendering the Projects section.",
  "frontend/src/components/layout/Footer.tsx": "Simple footer displaying a copyright line with a heart icon.",
  "frontend/src/components/layout/Section.tsx": "Reusable layout wrapper providing consistent section structure with optional title and subtitle.",
  "frontend/src/components/layout/TopNav.tsx": "Responsive navigation bar with dynamic links, scroll behavior, mobile menu, and CTA button.",
  "frontend/src/components/sections/AboutSection.tsx": "About section showing summary, location, email, and optionally phone in a styled card layout.",
  "frontend/src/components/sections/ContactSection.tsx": "Renders a contact section with email copy functionality, optional phone display, and social links pulled from resumeData.",
  "frontend/src/components/sections/EducationSection.tsx": "Displays education items from resumeData with degree, institution, location, details, and period formatting.",
  "frontend/src/components/sections/ExperienceSection.tsx": "Shows work experience entries from resumeData including role details, company info, description, and bullet highlights.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner showing name, title, and buttons that scroll to contact or about sections with decorative background.",
  "frontend/src/components/sections/ProjectsSection.tsx": "Lists featured projects with title, description, technologies, and optional external link, sourced from resumeData.",
  "frontend/src/components/sections/SkillsSection.tsx": "Renders skills either in a special two-column layout for one category or a multi-category grid with styled skill tags.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context with login, logout, and identity loading using AuthClient and DelegationIdentity.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future backend-related React Query hooks.",
  "frontend/src/index.css": "Configures Tailwind layers and defines light/dark theme CSS variables, base styles, and custom utility classes for layout and gradient text.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/resumeData.ts": "Defines TypeScript interfaces for resume content and provides structured resume data for experience, education, skills, and personal info.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, radii, animations, and plugins including typography, container queries, and animations.",
  "project_state.json": "Tracks project metadata, requirements, known issues, and architectural notes for the resume website's ongoing development."
}