{
  "kind": "build_request",
  "title": "Center Hero content like About section and restore “Hi, I’m …” greeting",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-15",
      "text": "Update the Hero/Intro section layout so its text content is centered in the middle of the page (visually centered like the “About Me” section), and ensure the Hero headline explicitly includes the greeting text “Hi, I’m …” (e.g., “Hi, I’m {resumeData.name}”) while keeping the rest of the Hero content (\"Computer Science\" line and the “Get in Touch” / “Learn More” buttons) present and centered below the headline.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "noo i said i want it in the middle of the website and i srtill want it to say Hi, I'm  ... i want it in the middle like how the \"About Me\" is in the middle opf the website"
        ]
      },
      "acceptanceCriteria": [
        "On desktop and mobile, the Hero text block is horizontally centered and visually aligned to the same centered content width style used by the “About Me” section (not left-aligned or stuck at the top).",
        "The primary Hero headline renders the literal greeting text \"Hi, I'm\" followed by the user’s name (from resumeData), in one centered headline line (wrapping naturally on small screens if needed).",
        "The \"Computer Science\" line remains centered and is rendered directly below the greeting headline.",
        "The “Get in Touch” and “Learn More” buttons remain visible and centered below the \"Computer Science\" line, and still scroll to the Contact and About sections respectively."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep the backend as a single Motoko actor; no new backend services."
  ],
  "nonGoals": [
    "Do not add new sections or change resume content fields in frontend/src/resumeData.ts as part of this request.",
    "Do not introduce new authentication, backend methods, or persistence changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}